IDEA StatiCa Open Model
ConcDiagramType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Concrete stress-strain diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ConcDiagramType
Public Enumeration ConcDiagramType
public enum class ConcDiagramType
Members
Member name | Value | Description
Bilinear | 0 |  Bilinear type
Parabolic | 1 |  Parabolic type
DefinedByUser | 2 |  Defined by user
See Also
Reference
IdeaRS.OpenModel.Material Namespace